DataProcessors/Renault_ARM_Менеджеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ARM_Менеджеры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтборМодель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборМенеджер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборОтдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборДилерскийЦентр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборМарка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаркаАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаКалендаря</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияКалендаря</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:DataProcessorObject.Renault_КалендарьСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Индексирование тел. номера для поиска</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияГК</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_Трафик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_Трафик</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипАктивности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ТипыАктивностиТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Закрытый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_РабочийЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Администратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПервичныйПовторный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ПервичныйПовторный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/CRM_ПервичныйПовторный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_ПервичныйПовторный</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Первичный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Повторный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/Renault_ARM_Менеджеры/Forms/ФормаПоискКлиента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДилерскийЦентр = Параметры.ДилерскийЦентр;
	Отдел = Параметры.Отдел;
	Менеджер = Параметры.Менеджер;
	
	Если Параметры.Свойство("ОтборФИО") Тогда ОтборФИО=Параметры.ОтборФИО КонецЕсли;
	Если Параметры.Свойство("ОтборЭлектроннаяПочта") Тогда ОтборЭлектроннаяПочта=Параметры.ОтборЭлектроннаяПочта КонецЕсли;
	Если Параметры.Свойство("ОтборТелефон") Тогда ОтборТелефон=Параметры.ОтборТелефон КонецЕсли;
	Если Параметры.Свойство("ОтборТрафикОбщий") Тогда ОтборТрафикОбщий=Параметры.ОтборТрафикОбщий КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДанныеТаблицыКлиентов();
	ОбновитьИнтерфейсФормы(); 
	
	//брендовое оформление
	Массив=Новый Массив;
	Массив.Добавить(Элементы.ЗакрытьФорму);
	Массив.Добавить(Элементы.Очистить);
	Массив.Добавить(Элементы.СоздатьРабочийЛистПоТрафику);
	Массив.Добавить(Элементы.СоздатьРабочийЛистБезТрафика);
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"ЦветФона","ОсновнойЦвет");
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"ЦветРамки","ОсновнойЦвет");
	//Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"ЦветТекста","ЦветТекста");
	
	Массив=Новый Массив;
	Массив.Добавить(Элементы.Logo);
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"Картинка","Логотип");
		
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОтборФИО = "";
	ОтборТелефон = "";
	ОтборЭлектроннаяПочта = "";
	
	ОбновитьДанныеТаблицыКлиентов();
	ОбновитьИнтерфейсФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОтборФИОПриИзменении(Элемент)
	ОбновитьДанныеТаблицыКлиентов();
	ОбновитьИнтерфейсФормы(); 
КонецПроцедуры

&НаКлиенте
Процедура ОтборТелефонПриИзменении(Элемент)
	ОбновитьДанныеТаблицыКлиентов();
	ОбновитьИнтерфейсФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВключатьВПоискПотенциальныхКлиентовПриИзменении(Элемент)
	ОбновитьДанныеТаблицыКлиентов();
	ОбновитьИнтерфейсФормы(); 
КонецПроцедуры

&НаКлиенте
Процедура ОтборЭлектроннаяПочтаПриИзменении(Элемент)
	ОбновитьДанныеТаблицыКлиентов();
	ОбновитьИнтерфейсФормы();  
КонецПроцедуры

&НаКлиенте
Процедура НайденныеКлиентыПриАктивизацииСтроки(Элемент)
	ТекущаяСтрока = Элементы.НайденныеКлиенты.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборФИО = ТекущаяСтрока.Клиент;
	ОтборТелефон = ТекущаяСтрока.Телефон;
	ОтборЭлектроннаяПочта = ТекущаяСтрока.Емайл;
	
	ОбновитьДанныеТаблицыТрафика(ТекущаяСтрока.Клиент);
	ОбновитьИнтерфейсФормы();
КонецПроцедуры

&НаКлиенте
Процедура ТрафикПоКлиентуПриАктивизацииСтроки(Элемент)
	ОбновитьИнтерфейсФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ЗакрытьЭтуФорму();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнтерфейсФормы()
	Элементы.СоздатьРабочийЛистПоТрафику.Доступность = ТрафикПоКлиенту.Количество() > 0 И
	Элементы.ТрафикПоКлиенту.ТекущиеДанные <> Неопределено;
		
	Элементы.кнФильтрДЦ.Заголовок = ?(ЗначениеЗаполнено(ДилерскийЦентр), ДилерскийЦентр, "<Все ДЦ>");
	Элементы.кнФильтрМенеджер.Заголовок = ?(ЗначениеЗаполнено(Менеджер), Менеджер, "<Все менеджеры>");
	Элементы.кнФильтрОтдел.Заголовок = ?(ЗначениеЗаполнено(Отдел), Отдел, "<Все отделы>");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеТаблицыКлиентов()
	НайденныеКлиенты.Очистить();
	ТрафикПоКлиенту.Очистить();
		
	ДанныеПоКлиентам = ПолучитьКлиентов(ОтборФИО, ОтборТелефон, ОтборЭлектроннаяПочта, ВключатьВПоискПотенциальныхКлиентов); 	
	
	Для Каждого Эл Из ДанныеПоКлиентам Цикл
		Стр = НайденныеКлиенты.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Эл); 				
	КонецЦикла;
	
	ОформлениеТаблицыКлиентов();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлиентов(ОтборФИО, ОтборТелефон, ОтборЭлектроннаяПочта, ВключатьВПоискПотенциальныхКлиентов)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИскатьПотенциальныхКлиентов", ВключатьВПоискПотенциальныхКлиентов);
	Если ЗначениеЗаполнено(СокрЛП(ОтборФИО)) Тогда
		Запрос.УстановитьПараметр("НаименованиеПолное", "%" + СокрЛП(ОтборФИО) + "%");
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ПОМЕСТИТЬ ВТ_Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления
		|	И НЕ Контрагенты.ЭтоГруппа
		|	И ПОДСТРОКА(Контрагенты.НаименованиеПолное, 0, 100) ПОДОБНО &НаименованиеПолное
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	CRM_ПотенциальныеКонтрагенты.Ссылка
		|ИЗ
		|	Справочник.CRM_ПотенциальныеКонтрагенты КАК CRM_ПотенциальныеКонтрагенты
		|ГДЕ
		|	НЕ CRM_ПотенциальныеКонтрагенты.ПометкаУдаления
		|	И НЕ CRM_ПотенциальныеКонтрагенты.ЭтоГруппа
		|	И ПОДСТРОКА(CRM_ПотенциальныеКонтрагенты.НаименованиеПолное, 0, 100) ПОДОБНО &НаименованиеПолное
		|	И ВЫБОР
		|			КОГДА &ИскатьПотенциальныхКлиентов = ИСТИНА
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Контрагенты).Ссылка
		|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты
		|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.CRM_ПотенциальныеКонтрагенты).Ссылка
		|	КОНЕЦ КАК Контрагент,
		|	КонтактнаяИнформация.Представление КАК Телефон,
		|	ВЫБОР
		|		КОГДА КонтактнаяИнформация.ЗначениеПоУмолчанию
		|			ТОГДА 2
		|		КОГДА КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСотовый)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПриоритетТелефон
		|ПОМЕСТИТЬ ВТ_ТелефоныКонтрагента
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВЫБОР
		|					КОГДА ВТ_Контрагент.Ссылка ССЫЛКА Справочник.Контрагенты
		|						ТОГДА ВЫРАЗИТЬ(ВТ_Контрагент.Ссылка КАК Справочник.Контрагенты).Ссылка
		|					КОГДА ВТ_Контрагент.Ссылка ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты
		|						ТОГДА ВЫРАЗИТЬ(ВТ_Контрагент.Ссылка КАК Справочник.CRM_ПотенциальныеКонтрагенты).Ссылка
		|				КОНЕЦ КАК Клиент
		|			ИЗ
		|				ВТ_Контрагент КАК ВТ_Контрагент)
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Контрагенты).Ссылка
		|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты
		|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.CRM_ПотенциальныеКонтрагенты).Ссылка
		|	КОНЕЦ КАК Контрагент,
		|	КонтактнаяИнформация.Представление КАК Емайл,
		|	ВЫБОР
		|		КОГДА КонтактнаяИнформация.ЗначениеПоУмолчанию
		|			ТОГДА 2
		|		КОГДА КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПриоритетЕмайл
		|ПОМЕСТИТЬ ВТ_ЕмайлыКонтрагента
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВЫБОР
		|					КОГДА ВТ_Контрагент.Ссылка ССЫЛКА Справочник.Контрагенты
		|						ТОГДА ВЫРАЗИТЬ(ВТ_Контрагент.Ссылка КАК Справочник.Контрагенты).Ссылка
		|					КОГДА ВТ_Контрагент.Ссылка ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты
		|						ТОГДА ВЫРАЗИТЬ(ВТ_Контрагент.Ссылка КАК Справочник.CRM_ПотенциальныеКонтрагенты).Ссылка
		|				КОНЕЦ КАК Клиент
		|			ИЗ
		|				ВТ_Контрагент КАК ВТ_Контрагент)
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_Контрагент.Ссылка ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_Контрагент.Ссылка КАК Справочник.Контрагенты).Ссылка
		|		КОГДА ВТ_Контрагент.Ссылка ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_Контрагент.Ссылка КАК Справочник.CRM_ПотенциальныеКонтрагенты).Ссылка
		|	КОНЕЦ КАК Клиент,
		|	ЕСТЬNULL(ВТ_ТелефоныКонтрагента.Телефон, """") КАК Телефон,
		|	ЕСТЬNULL(ВТ_ЕмайлыКонтрагента.Емайл, """") КАК Емайл,
		|	ЕСТЬNULL(ВТ_ТелефоныКонтрагента.ПриоритетТелефон, 0) КАК ПриоритетТелефон,
		|	ЕСТЬNULL(ВТ_ЕмайлыКонтрагента.ПриоритетЕмайл, 0) КАК ПриоритетЕмайл,
		|	ВЫБОР
		|		КОГДА ВТ_Контрагент.Ссылка ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ЛОЖЬ
		|		КОГДА ВТ_Контрагент.Ссылка ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты
		|			ТОГДА ИСТИНА
		|	КОНЕЦ КАК ЭтоПотенциальныйКлиент
		|ИЗ
		|	ВТ_Контрагент КАК ВТ_Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТелефоныКонтрагента КАК ВТ_ТелефоныКонтрагента
		|		ПО ВТ_Контрагент.Ссылка = ВТ_ТелефоныКонтрагента.Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕмайлыКонтрагента КАК ВТ_ЕмайлыКонтрагента
		|		ПО ВТ_Контрагент.Ссылка = ВТ_ЕмайлыКонтрагента.Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПриоритетТелефон УБЫВ,
		|	ПриоритетЕмайл УБЫВ
		|ИТОГИ ПО
		|	Клиент";
	ИначеЕсли ЗначениеЗаполнено(СокрЛП(ОтборТелефон)) Тогда
		
		Телефон = СтрСоединить(СтрРазделить(ОтборТелефон, " ()-+", Ложь), "");
		
		//DMSCOR-1026
		//Отбор = "";
		//Для к = 1 По СтрДлина(Телефон) Цикл
		//	Сим = Сред(Телефон, к, 1);
		//	Если к = 1 И (Сим = "7" ИЛИ Сим = "8") Тогда Продолжить КонецЕсли;
		//	Отбор = Отбор + "%" + Сим;	
		//КонецЦикла;
		//Запрос.УстановитьПараметр("Телефон", Отбор + "%");
		
		ПервыйСимвол = Лев(Телефон, 1);
		Если ПервыйСимвол = "7" ИЛИ ПервыйСимвол = "8" Тогда
			Телефон = Сред(Телефон, 2);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Телефон", "%" + Телефон + "%");
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Контрагенты).Ссылка
		|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты
		|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.CRM_ПотенциальныеКонтрагенты).Ссылка
		|	КОНЕЦ КАК Контрагент,
		|	КонтактнаяИнформация.Представление КАК Телефон
		|ПОМЕСТИТЬ ВТ_ТелефоныКонтрагента
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|	И ВЫБОР
		|			КОГДА КонтактнаяИнформация.Поле1 <> """"
		|					И КонтактнаяИнформация.Поле2 <> """"
		|					И КонтактнаяИнформация.Поле3 <> """"
		|				ТОГДА """" + КонтактнаяИнформация.Поле1 + КонтактнаяИнформация.Поле2 + КонтактнаяИнформация.Поле3 ПОДОБНО &Телефон
		|			ИНАЧЕ КонтактнаяИнформация.Представление ПОДОБНО &Телефон
		|		КОНЕЦ
		|	И (КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
		|			ИЛИ ВЫБОР
		|				КОГДА &ИскатьПотенциальныхКлиентов = ИСТИНА
		|					ТОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Контрагенты).Ссылка
		|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты
		|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.CRM_ПотенциальныеКонтрагенты).Ссылка
		|	КОНЕЦ КАК Контрагент,
		|	КонтактнаяИнформация.Представление КАК Емайл,
		|	ВЫБОР
		|		КОГДА КонтактнаяИнформация.ЗначениеПоУмолчанию
		|			ТОГДА 2
		|		КОГДА КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПриоритетЕмайл
		|ПОМЕСТИТЬ ВТ_ЕмайлыКонтрагента
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|	И КонтактнаяИнформация.Объект В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВЫБОР
		|					КОГДА ВТ_ТелефоныКонтрагента.Контрагент ССЫЛКА Справочник.Контрагенты
		|						ТОГДА ВЫРАЗИТЬ(ВТ_ТелефоныКонтрагента.Контрагент КАК Справочник.Контрагенты).Ссылка
		|					КОГДА ВТ_ТелефоныКонтрагента.Контрагент ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты
		|						ТОГДА ВЫРАЗИТЬ(ВТ_ТелефоныКонтрагента.Контрагент КАК Справочник.CRM_ПотенциальныеКонтрагенты).Ссылка
		|				КОНЕЦ КАК Клиент
		|			ИЗ
		|				ВТ_ТелефоныКонтрагента КАК ВТ_ТелефоныКонтрагента)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_ТелефоныКонтрагента.Контрагент ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТелефоныКонтрагента.Контрагент КАК Справочник.Контрагенты).Ссылка
		|		КОГДА ВТ_ТелефоныКонтрагента.Контрагент ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТелефоныКонтрагента.Контрагент КАК Справочник.CRM_ПотенциальныеКонтрагенты).Ссылка
		|	КОНЕЦ КАК Клиент,
		|	ВТ_ТелефоныКонтрагента.Телефон КАК Телефон,
		|	ЕСТЬNULL(ВТ_ЕмайлыКонтрагента.Емайл, """") КАК Емайл,
		|	ЕСТЬNULL(ВТ_ЕмайлыКонтрагента.ПриоритетЕмайл, 0) КАК ПриоритетЕмайл,
		|	ВЫБОР
		|		КОГДА ВТ_ТелефоныКонтрагента.Контрагент ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ЛОЖЬ
		|		КОГДА ВТ_ТелефоныКонтрагента.Контрагент ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты
		|			ТОГДА ИСТИНА
		|	КОНЕЦ КАК ЭтоПотенциальныйКлиент
		|ИЗ
		|	ВТ_ТелефоныКонтрагента КАК ВТ_ТелефоныКонтрагента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕмайлыКонтрагента КАК ВТ_ЕмайлыКонтрагента
		|		ПО ВТ_ТелефоныКонтрагента.Контрагент = ВТ_ЕмайлыКонтрагента.Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПриоритетЕмайл УБЫВ
		|ИТОГИ ПО
		|	Клиент";
	ИначеЕсли ЗначениеЗаполнено(СокрЛП(ОтборЭлектроннаяПочта)) Тогда
		Запрос.УстановитьПараметр("Емайл", "%" + СокрЛП(ОтборЭлектроннаяПочта) + "%");
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Контрагенты).Ссылка
		|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты
		|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.CRM_ПотенциальныеКонтрагенты).Ссылка
		|	КОНЕЦ КАК Контрагент,
		|	КонтактнаяИнформация.Представление КАК Емайл
		|ПОМЕСТИТЬ ВТ_ЕмайлыКонтрагента
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|	И КонтактнаяИнформация.Представление ПОДОБНО &Емайл
		|	И (КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
		|			ИЛИ ВЫБОР
		|				КОГДА &ИскатьПотенциальныхКлиентов = ИСТИНА
		|					ТОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Контрагенты).Ссылка
		|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты
		|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.CRM_ПотенциальныеКонтрагенты).Ссылка
		|	КОНЕЦ КАК Контрагент,
		|	КонтактнаяИнформация.Представление КАК Телефон,
		|	ВЫБОР
		|		КОГДА КонтактнаяИнформация.ЗначениеПоУмолчанию
		|			ТОГДА 2
		|		КОГДА КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСотовый)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПриоритетТелефон
		|ПОМЕСТИТЬ ВТ_ТелефоныКонтрагента
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|	И КонтактнаяИнформация.Объект В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВЫБОР
		|					КОГДА ВТ_ЕмайлыКонтрагента.Контрагент ССЫЛКА Справочник.Контрагенты
		|						ТОГДА ВЫРАЗИТЬ(ВТ_ЕмайлыКонтрагента.Контрагент КАК Справочник.Контрагенты).Ссылка
		|					КОГДА ВТ_ЕмайлыКонтрагента.Контрагент ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты
		|						ТОГДА ВЫРАЗИТЬ(ВТ_ЕмайлыКонтрагента.Контрагент КАК Справочник.CRM_ПотенциальныеКонтрагенты).Ссылка
		|				КОНЕЦ КАК Клиент
		|			ИЗ
		|				ВТ_ЕмайлыКонтрагента КАК ВТ_ЕмайлыКонтрагента)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_ЕмайлыКонтрагента.Контрагент ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ЕмайлыКонтрагента.Контрагент КАК Справочник.Контрагенты).Ссылка
		|		КОГДА ВТ_ЕмайлыКонтрагента.Контрагент ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ЕмайлыКонтрагента.Контрагент КАК Справочник.CRM_ПотенциальныеКонтрагенты).Ссылка
		|	КОНЕЦ КАК Клиент,
		|	ВТ_ЕмайлыКонтрагента.Емайл КАК Емайл,
		|	ЕСТЬNULL(ВТ_ТелефоныКонтрагента.Телефон, """") КАК Телефон,
		|	ЕСТЬNULL(ВТ_ТелефоныКонтрагента.ПриоритетТелефон, 0) КАК ПриоритетТелефон,
		|	ВЫБОР
		|		КОГДА ВТ_ЕмайлыКонтрагента.Контрагент ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ЛОЖЬ
		|		КОГДА ВТ_ЕмайлыКонтрагента.Контрагент ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты
		|			ТОГДА ИСТИНА
		|	КОНЕЦ КАК ЭтоПотенциальныйКлиент
		|ИЗ
		|	ВТ_ЕмайлыКонтрагента КАК ВТ_ЕмайлыКонтрагента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТелефоныКонтрагента КАК ВТ_ТелефоныКонтрагента
		|		ПО ВТ_ЕмайлыКонтрагента.Контрагент = ВТ_ТелефоныКонтрагента.Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПриоритетТелефон УБЫВ
		|ИТОГИ ПО
		|	Клиент";	
	КонецЕсли;
	
	ДанныеПоКлиенту = Новый Массив;	
	
	Если НЕ ЗначениеЗаполнено(Запрос.Текст) Тогда
		Возврат ДанныеПоКлиенту;
	КонецЕсли;  	
	
	Результат = Запрос.Выполнить();  	
	
	Если НЕ Результат.Пустой() Тогда
		ВыборкаИтоги = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Счетчик = 1;
		Пока ВыборкаИтоги.Следующий() Цикл
			Выборка = ВыборкаИтоги.Выбрать();  			
			
			Пока Выборка.Следующий() Цикл
				Стр = Новый Структура("НомерСтроки, Клиент, Емайл, Телефон, ЭтоПотенциальныйКлиент");
				Стр.Вставить("НомерСтроки", Счетчик);
				ЗаполнитьЗначенияСвойств(Стр, Выборка);
				
				ДанныеПоКлиенту.Добавить(Стр);
				
				Счетчик = Счетчик + 1;
				Прервать;				
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;

	Возврат ДанныеПоКлиенту;
КонецФункции

&НаКлиенте
Процедура ОбновитьДанныеТаблицыТрафика(Клиент)
	ТрафикПоКлиенту.Очистить();  
	
	ОтборДляТрафика = Новый Структура("ДилерскийЦентр, Отдел, Клиент, Менеджер, ОтборТрафикОбщий", 
		ДилерскийЦентр, Отдел, Клиент, Менеджер, ОтборТрафикОбщий);
		
	ДанныеТрафика = ПолучитьДанныеТрафика(ОтборДляТрафика);
	
	Для Каждого Эл Из ДанныеТрафика Цикл
		Стр = ТрафикПоКлиенту.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Эл);
	КонецЦикла; 		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеТрафика(ОтборДляТрафика)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_Трафик.Период КАК ДатаВремя,
		|	Renault_Трафик.Идентификатор КАК ID,
		|	Renault_Трафик.ПервичныйИнтерес КАК ПервичныйИнтерес,
		|	ПОДСТРОКА(ВЫБОР
		|			КОГДА Renault_Трафик.Клиент ССЫЛКА Справочник.Контрагенты
		|				ТОГДА ВЫРАЗИТЬ(Renault_Трафик.Клиент КАК Справочник.Контрагенты).НаименованиеПолное
		|		КОНЕЦ, 0, 200) КАК ФИО,
		|	ПОДСТРОКА(Renault_Трафик.Комментарий, 0, 200) КАК Комментарий
		|ИЗ
		|	РегистрСведений.Renault_Трафик КАК Renault_Трафик
		|ГДЕ
		|	Renault_Трафик.Менеджер = ЕСТЬNULL(&Менеджер, Renault_Трафик.Менеджер)
		|	И НЕ Renault_Трафик.Обработан
		|	И Renault_Трафик.Клиент = &Клиент
		|	И Renault_Трафик.Менеджер <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|	И Renault_Трафик.ДилерскийЦентр = ЕСТЬNULL(&ДилерскийЦентр, Renault_Трафик.ДилерскийЦентр)
		|	И Renault_Трафик.Отдел = ЕСТЬNULL(&Отдел, Renault_Трафик.Отдел)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Renault_Трафик.Период,
		|	Renault_Трафик.Идентификатор,
		|	Renault_Трафик.ПервичныйИнтерес,
		|	ПОДСТРОКА(ВЫБОР
		|			КОГДА Renault_Трафик.Клиент ССЫЛКА Справочник.Контрагенты
		|				ТОГДА ВЫРАЗИТЬ(Renault_Трафик.Клиент КАК Справочник.Контрагенты).НаименованиеПолное
		|		КОНЕЦ, 0, 200),
		|	ПОДСТРОКА(Renault_Трафик.Комментарий, 0, 200)
		|ИЗ
		|	РегистрСведений.Renault_Трафик КАК Renault_Трафик
		|ГДЕ
		|	Renault_Трафик.Менеджер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|	И НЕ Renault_Трафик.Обработан
		|	И Renault_Трафик.Клиент = &Клиент
		|	И &ОтборТрафикОбщий = ИСТИНА
		|	И Renault_Трафик.ДилерскийЦентр = ЕСТЬNULL(&ДилерскийЦентр, Renault_Трафик.ДилерскийЦентр)
		|	И Renault_Трафик.Отдел = ЕСТЬNULL(&Отдел, Renault_Трафик.Отдел)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВремя";
	Запрос.УстановитьПараметр("ДилерскийЦентр", ?(ЗначениеЗаполнено(ОтборДляТрафика.ДилерскийЦентр),ОтборДляТрафика.ДилерскийЦентр, NULL));
	Запрос.УстановитьПараметр("Клиент", ОтборДляТрафика.Клиент);
	Запрос.УстановитьПараметр("Менеджер", ?(ЗначениеЗаполнено(ОтборДляТрафика.Менеджер), ОтборДляТрафика.Менеджер, NULL));
	Запрос.УстановитьПараметр("ОтборТрафикОбщий", ОтборДляТрафика.ОтборТрафикОбщий);
	Запрос.УстановитьПараметр("Отдел", ?(ЗначениеЗаполнено(ОтборДляТрафика.Отдел), ОтборДляТрафика.Отдел, NULL));
	Результат = Запрос.Выполнить();
	
	ДанныеТрафика = Новый Массив;
	
	Если НЕ Результат.Пустой() Тогда 	
		Выборка = Результат.Выбрать();
		
		Счетчик = 1;
		Пока Выборка.Следующий() Цикл
			Стр = Новый Структура("НомерСтроки, ID, ДатаВремя, ПервичныйИнтерес, ФИО, Комментарий");
			Стр.Вставить("НомерСтроки", Счетчик);
			ЗаполнитьЗначенияСвойств(Стр, Выборка);
			
			ДанныеТрафика.Добавить(Стр);
			
			Счетчик = Счетчик + 1;
		КонецЦикла;  	
	КонецЕсли;
	
	Возврат ДанныеТрафика;
КонецФункции

&НаСервере
Процедура ОформлениеТаблицыКлиентов()
	//ЦветФонаСтроки = Новый Цвет(255, 207, 100);
	ЦветФонаСтроки=Вычислить(Renault_ОбщиеФункцииСервер.МультибрендПараметрыОформления().ОсновнойЦвет);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Использование = Истина;
	
	ОформлениеУО = ЭлементУсловногоОформления.Оформление;
	ОтборУО = ЭлементУсловногоОформления.Отбор;
	ОформляемыеПоляУО = ЭлементУсловногоОформления.Поля;
	
	ОформлениеУО.УстановитьЗначениеПараметра("ЦветФона", ЦветФонаСтроки);
	
	ЭлементОтбора                = ОтборУО.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("НайденныеКлиенты.ЭтоПотенциальныйКлиент");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование  = Истина;
	
	ЭлТабНайденныеКлиенты = Элементы.НайденныеКлиенты.ПодчиненныеЭлементы; 
	Для каждого Элемент Из ЭлТабНайденныеКлиенты Цикл
		НазваниеЭлемента = Элемент.Имя;
		ОформляемоеПоле = ОформляемыеПоляУО.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(НазваниеЭлемента);
	КонецЦикла; 		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРабочийЛистПоТрафику(Команда)
	ТекущаяСтрокаКлиент = Элементы.НайденныеКлиенты.ТекущиеДанные;
	Если ТекущаяСтрокаКлиент = Неопределено Тогда
		Сообщить("Выберите клиента из табилицы, для создания рабочего листа!"); 
		Возврат;
	КонецЕсли;
	
	ID = Элементы.ТрафикПоКлиенту.ТекущиеДанные.ID;
	ЗадатьВопрос = Ложь;
	ЗаписьРЛIDK = Неопределено;
	
	СоздатьРабочийЛистПоТрафикуСервер(ID, Менеджер, ЗаписьРЛIDK, ЗадатьВопрос);
	
	Если ЗаписьРЛIDK <> Неопределено Тогда
		РЛПоПродаже = Ложь;
		Если ЗадатьВопрос Тогда
		    Режим = РежимДиалогаВопрос.ДаНет;             
			Ответ = Вопрос("Это будет продажа?", Режим, 0);
			Если Ответ = КодВозвратаДиалога.Да Тогда
			    РЛПоПродаже = Истина;
			КонецЕсли;
		КонецЕсли;
		
		ЗаписьРЛ = Renault_CRM.ПолучитьЗаписьРЛПоIDK(ЗаписьРЛIDK);
		
		ФормаЗаписи = ЗаписьРЛ.ПолучитьФорму("ФормаЗаписи",,"ФормаЗаписи" + Строка(ЗаписьРЛ.IDK));
		Если ФормаЗаписи.Открыта() Тогда
			ФормаЗаписи.Активизировать();
		Иначе
			ФормаЗаписи.РЛПоПродаже = РЛПоПродаже;
			ФормаЗаписи.Открыть();
		КонецЕсли;
		
		ЗакрытьЭтуФорму();
	Иначе
		Сообщить("Не удалось создать рабочий лист!");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьРабочийЛистПоТрафикуСервер(ID, Менеджер,  ЗаписьРЛIDK, ЗадатьВопрос)
	ЗаписьТрафик = Renault_CRM.ПолучитьЗаписьТрафикаПоID(ID);
	
	Если ЗаписьТрафик <> Неопределено Тогда
		
		Если ЗаписьТрафик.ПервичныйПовторный = Перечисления.CRM_ПервичныйПовторный.Повторный Тогда
			//Переведем в первичный
			ЗаписьТрафик.ПервичныйПовторный = Перечисления.CRM_ПервичныйПовторный.Первичный;
		КонецЕсли;
		
		ЗаписьТрафик.Менеджер = Менеджер;
		ЗаписьТрафик.Записать();
		
		ЗаписьРЛ = Renault_CRM.СоздатьРабочийЛистПоТрафику(ID, Менеджер);
		
		ЗаписьЗадача = Renault_CRM.ПолучитьЗаписьЗадачиПоIDТрафика(ID);
		
		ЗаписьРЛIDK = ЗаписьРЛ.IDK;
		
		//Если есть задача по трафику - закроем ее
		Если ЗаписьЗадача <> Неопределено Тогда
			ЗаписьЗадача.Обработано = Истина;
			ЗаписьЗадача.ДатаВремяЗавершения = ТекущаяДата();
			ЗаписьЗадача.КомментарийПриЗакрытии = "Создан рабочий лист " + "№" + Строка(ЗаписьРЛIDK);
			ЗаписьЗадача.Записать();
		КонецЕсли;	
		
		Если ЗаписьРЛ <> Неопределено Тогда
			Если ЗначениеЗаполнено(ЗаписьРЛ.Отдел) И НЕ ЗначениеЗаполнено(ЗаписьРЛ.ТипРабочегоЛиста) Тогда
				Если ЗаписьРЛ.Отдел.КлассификацияRenault = Перечисления.CRM_КлассификацияОтделов.ОтделТрейдИн Тогда
					ЗадатьВопрос = Истина;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРабочийЛистБезТрафика(Команда)
	ТекущаяСтрока = Элементы.НайденныеКлиенты.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Сообщить("Выберите клиента из табилицы, для создания рабочего листа!");
		Возврат;
	КонецЕсли;
	
	Форма = Обработки.Renault_ARM_Менеджеры.ПолучитьФорму("ФормаРегистрацииНовогоРЛ");
	Форма.Отдел = Отдел;
	Форма.Клиент = ТекущаяСтрока.Клиент;
	Форма.Телефон = ТекущаяСтрока.Телефон;
	Запись = Форма.ОткрытьМодально();
	Если Запись <> Неопределено Тогда
		ФормаЗаписи = Запись.ПолучитьФорму("ФормаЗаписи",,"ФормаЗаписи"+ Строка(Запись.IDK));
		Если ФормаЗаписи.Открыта() Тогда
			ФормаЗаписи.Активизировать();
		Иначе
			ФормаЗаписи.Открыть();
		КонецЕсли;
		
		ЗакрытьЭтуФорму();
	Иначе
		Сообщить("Не удалось создать рабочий лист!");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьЭтуФорму()
	Если Элементы.НайденныеКлиенты.ТекущиеДанные = Неопределено Тогда
		Сообщить("Не выбран клиент для поиска");
		Возврат;
	КонецЕсли;
	
	ДанныеПоКлиенту = Новый Структура("Клиент,ОтборФИО, ОтборТелефон, ОтборЭлектроннаяПочта", Элементы.НайденныеКлиенты.ТекущиеДанные.Клиент,ОтборФИО, ОтборТелефон, ОтборЭлектроннаяПочта);
	ЭтаФорма.Закрыть(ДанныеПоКлиенту);
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоМенеджеруНаСервере(Пользователь)
	Менеджер = Пользователь.Сотрудник;
	Отдел = Renault_РаботаСПравамиПользователя.ОтделпоУмолчанию(Пользователь);
	ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя(Отдел);
КонецПроцедуры

&НаСервере
Функция ЕстьПраво(Право,Пользователь = Неопределено)
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.Пользователь;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки КАК Шаблон 
	                   |ИЗ
	                   |	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                   |ГДЕ
	                   |	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Шаблоны = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрШаблоны Из Шаблоны Цикл
		Возврат	СтрШаблоны.Шаблон[Право];
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуДилерскиеЦентры()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ДилерскиеЦентры.Ссылка КАК ДилерскийЦентр
	                      |ИЗ
	                      |	Справочник.CRM_ДилерскиеЦентры КАК CRM_ДилерскиеЦентры
	                      |ГДЕ
	                      |	CRM_ДилерскиеЦентры.ПометкаУдаления = ЛОЖЬ");	
	ТаблицаИтог = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаИтог;
КонецФункции

&НаКлиенте
Процедура кнФильтрДЦ(Команда)
	Если ЕстьПраво("Продажи_РазрешитьПоискРабочихЛистовВоВсехДЦ") = Ложь тогда
		Предупреждение("Вам недоступны прочие дилерские центры");
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Новый СписокЗначений();
	Таблица = ПолучитьТаблицуДилерскиеЦентры();
	Для Каждого Тек Из Таблица Цикл
		СписокВыбора.Добавить(Тек.ДилерскийЦентр);
    КонецЦикла;
	ФормаСписка = ПолучитьФорму("Обработка.Renault_ARM_Администратор.Форма.ФормаВыбораИзСпискаПлиткой");
	ФормаСписка.Список = СписокВыбора;
	ФормаСписка.Заголовок = "Выбор дилерского центра";
	ФормаСписка.КнопокВСтроке = 1;
	ФормаСписка.ВысотаКнопки = 40;
	Ответ = ФормаСписка.ОткрытьМодально();
	Если ЗначениеЗаполнено(Ответ) Тогда
		ДилерскийЦентр = Ответ;
	ИначеЕсли Команда.Имя = "кнФильтрДЦ" Тогда
		ДилерскийЦентр = Неопределено;
	КонецЕсли;
	
	Если Команда.Имя <> "кнФильтрДЦ" И ЗначениеЗаполнено(ДилерскийЦентр) Тогда
		Выполнить(Команда.Имя + "(Команда)");
	Иначе
		ОбновитьДанныеНаФормеПослеФильтра();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура кнФильтрОтдел(Команда)
	Если Не ЗначениеЗаполнено(ДилерскийЦентр) Тогда
		кнФильтрДЦ(Команда);
		Возврат;
	КонецЕсли;
	
	ФормаСписка = ПолучитьФорму("Обработка.Renault_ARM_Администратор.Форма.ФормаВыбораИзСпискаПлиткой");
	Список = Renault_CRM.ПолучитьСписокПрочихОтделовЦентра(ДилерскийЦентр);
	ФормаСписка.Список = Список;
	ФормаСписка.Заголовок = "Выбор отдела";
	Ответ = ФормаСписка.ОткрытьМодально();
	Если ЗначениеЗаполнено(Ответ) Тогда
		Отдел = Ответ;
	ИначеЕсли Команда.Имя = "кнФильтрОтдел" Тогда
		Отдел = Неопределено;
	КонецЕсли;
	
	Если Команда.Имя <> "кнФильтрОтдел" И ЗначениеЗаполнено(Отдел) Тогда
		Выполнить(Команда.Имя + "(Команда)");
	Иначе
		ОбновитьДанныеНаФормеПослеФильтра();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура кнФильтрМенеджер(Команда)
	Если Не ЗначениеЗаполнено(Отдел) Тогда
		кнФильтрОтдел(Команда);
		Возврат;
	КонецЕсли;
	
	Список = Renault_CRM.ПолучитьСписокСотрудниковПоОтделу(Отдел);
	ФормаСписка = ПолучитьФорму("Обработка.Renault_ARM_Администратор.Форма.ФормаВыбораИзСпискаПлиткой");
	ФормаСписка.Список = Список;
	ФормаСписка.Заголовок = "Выбор менеджера";
	ФормаСписка.ЭтоВыборСотрудника = Истина;
	ФормаСписка.КнопокВСтроке = 2;
	ФормаСписка.ВысотаКнопки = 40;
	Ответ = ФормаСписка.ОткрытьМодально();
	Если ЗначениеЗаполнено(Ответ) Тогда
		Менеджер = Ответ;
	Иначе 
		Менеджер = Неопределено;
	КонецЕсли;
	
	ОбновитьДанныеНаФормеПослеФильтра();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеНаФормеПослеФильтра()
	//ОбновитьДанныеТаблицыКлиентов();
	
	Если Элементы.НайденныеКлиенты.ТекущиеДанные <> Неопределено Тогда
		ОбновитьДанныеТаблицыТрафика(Элементы.НайденныеКлиенты.ТекущиеДанные.Клиент);
	КонецЕсли;
	
	ОбновитьИнтерфейсФормы();
КонецПроцедуры
